/******************** (C) COPYRIGHT 2016 DammStanger *****************************************
**--------------文件信息----------------------------------------------------------
 * 文件名	：flash.h
 * 描	述	：
 *            
 * 实验平台	：
 * 硬件连接	：
 * 版 	本	：
 * 从属关系	：
 * 库版本	：
 * 创建时间	：
 * 最后编辑	：
 **-------------------------------------------------------------------------------

 * 作	者	：Damm Stanger
 * 邮	箱	：dammstanger@qq.com
**********************************************************************************************/
#ifndef __FLASH_H_
#define __FLASH_H_
/****************************包含头文件*******************************************/
#include "stm32f10x.h"
#include "stmflash.h"

/****************************宏定义***********************************************/
//F103T8 128k 0-127个扇区 地址范围0x08000000-0x0801ffff(两个扇区2048字节)
//程序实际占用空间：可在.map文件中找到
//

#define FLASH_ROOM1_ADDR  	0X0801F800 	//设置FLASH 保存地址(必须为偶数，且其值要大于本代码所占用FLASH的大小+0X08000000)
#define FLASH_ROOM2_ADDR  	0X0801FC00 	//设置FLASH 保存地址(必须为偶数，且其值要大于本代码所占用FLASH的大小+0X08000000)
#define FLASH_BUF_SIZE		100			//
/****************************类型定义*********************************************/

/****************************变量声明*********************************************/
extern u16 FlashWbuf[FLASH_BUF_SIZE];
extern u16 FlashRbuf[FLASH_BUF_SIZE];
/****************************变量定义*********************************************/

/****************************函数声明*********************************************/  
u8 Flash_ReadPID(u16 *Par_rol_pit,u16 *Par_yaw,u16 *Par_rp_rate);
void Flash_WritePID(u16 *Par_rol_pit,u16 *Par_yaw,u16 *Par_rp_rate);



#endif



/******************* (C) COPYRIGHT 2016 DammStanger *****END OF FILE************/


